<!DOCTYPE html>
<html>
<head>
	<title>
	</title>
	<meta charset="UTF-8" />
	<link href='http://fonts.googleapis.com/css?family=Bitter' rel='stylesheet' type='text/css'>
	<style>
	#MainDiv{
		position: absolute;
		top: 10%;
		left: 10%;
		width: 70%;
	}
	#HeaderDiv{
		position: relative;
		top: 0%;
		left: 0%;
		height: auto;
		width: 100%;
		text-align: center;
		font-size: 250%;
		font-family: 'Bitter', serif;
	}
	#DescriptionDiv{
		position: relative;
		top: 0%;
		left: 0%;
		height: auto;
		width: 100%;
		text-align: center;
		font-size: 130%;
		padding: 5px 5px 5px 5px;
		word-wrap: 
	}
	#TypeMenuDiv{
		position: absolute;
		top: 0%;
		left: 100%;
		height: auto;
		width: 20%;
	}
	.letters{
		border: 1px solid red;
		margin: 5px 5px 5px 5px;
		padding: 5px 5px 5px 5px;
		background-color: #90EE90;
		display: inline;
		font-size: 140%
	}
	
	.LettersContainer{
		margin: 10% 10% 10% 10%;
	}
	
	.LettersCombinationText{
		visibility: hidden;
	}
	
	
	</style>
	
	
</head>

<body>
	<div id="MainDiv">
		<div id="HeaderDiv">HELLO WORLD</div>
		<div id="DescriptionDiv"></div>
		<div id="TypeMenuDiv">
			<div id="E_I" class="LettersContainer">
				<div id="E" class="letters">E</div>
				<div id="I" class="letters">I</div>
			</div>
			<div id="S_N" class="LettersContainer">
				<div id="S" class="letters">S</div>
				<div id="N" class="letters">N</div>
			</div>
			<div id="F_T" class="LettersContainer">
				<div id="F" class="letters">F</div>
				<div id="T" class="letters">T</div>
			</div>
			<div id="J_P" class="LettersContainer">
				<div id="J" class="letters">J</div>
				<div id="P" class="letters">P</div>
			</div>			
		</div>
	</div>
	
	<div id="ESTJ" class="LettersCombinationText">
	ESTJ - АДМИНИСТРАТОР <br>
	ESTJ очень прочно связаны с окружающей обстановкой. Они знают об этом, и это знание придает им силы. Лучшее прилагательное, с помощью которого можно описать ESTJ, - "ответственный". ESTJ обладают исключительной способностью организовывать обязательные мероприятия и детально руководствоваться различными правилами, расписаниями. Нетерпимы к тем, кто выполняет задания без достаточного внимания к деталям и тонкостям, предписанным более опытными и искушенными в этой области людьми
	ESTJ довольно верно оценивают окружающих. Временами они могут грубить тем, кто не следует правилам точно. Реалистичные, любящие факты люди, их более интересуют новые технологические процессы и технические средства, чем принципы и теории.
	ESTJ преданы своей работе, своей организации и обществу; они замечательные супруги и родители. Знают, в чем состоит их долг, и вряд ли станут уклоняться от его выполнения, даже если это потребует значительных жертв. Нередко ESTJ достигают высокого ответственного положения в работе и в обществе. Очень часто они являются членами нескольких клубов и поддерживают их существование своим присутствием и постоянным общением с их членами. Пунктуальны и надеются встретить это свойство в окружающих.
	ESTJ могут не всегда прислушиваться к чужому мнению и склонны делать поспешные выводы. Они могут не дослушать собеседника до конца, особенно ярко это проявляется тогда, когда ESTJ стоит на позиции начальника. Им необходима постоянно прилагать значительные усилия, чтобы оставаться открытыми и прислушиваться к мнению тех, кто от них зависит: детей, супругов, подчиненных.
	ESTJ настолько срастаются с работой по строгому распорядку, по заведенным правилам, что не в состоянии понять тех, кто отказывается выполнять эти порядки или пытается их изменить. Они следуют распорядку на работе и дома, стремясь найти каждой вещи свое место и желая видеть ее только на этом месте. Обычно они точны и обязательны в работе и в игре.
	</div>
	<div id="ESTP" class="LettersCombinationText">
	ESTP - АНТЕРПРЕНЕР<br>
	ESTP мужчина или женщина - это человек дела. С появлением ESTP что-то начинает происходить: зажигаются огни, звучит музыка, начинается игра. ESTP созданы для такой игры: замечательные предприниматели, чуткие, энергичные посредники или дипломаты, налаживающие международные отношения. И если поискать прилагательное, кратко описывающее ESTP, "неистощимый" подошло бы наилучшим образом.
	Выдающиеся способности демонстрируют ESTP в ситуациях, когда необходимо деловое посредничество. Как никто другой, ESTP могут "сорить" идеями и проектами, но органически не выносят оттачивания административных и технических деталей. В связи с этим часто случается так, что талант ESTP остается недооцененным, поскольку мелкие недоработки в деталях (к которым ESTP относятся без должного внимания) лишают их работу блеска завершенности. Лишь немногие руководители организаций умеют использовать неординарные способности ESTP в полной мере. Когда же ESTP полагаются только на самих себя, успех не всегда сопутствует им из-за пренебрежения к деталям, неизбежно возникающим в процессе отладки проекта. ESTP нуждаются в людях, берущих на себя заботы об этих неизбежных "мелочах".
	ESTP живут сегодняшним днем, текущим моментом и вносят в семейный уклад элемент непредсказуемого, волнующего ожидания. Супруги ESTP бывают заметны на людях, обращая на себя внимание окружающих. Их запас остроумных шуток и веселых историй неистощим, и компания, в которой есть ESTP, едва ли будет скучать. Для своих друзей ESTP не жалеют буквально ничего, и даже семейные обязанности могут отступить на второй план. Серьезные проблемы, однако, нечасто встречаются в жизни ESTP, хотя они и обладают широким кругом деловых знакомств. Элемент непредсказуемости, волнения, веселого возбуждения всегда присутствует во взаимоотношениях ESTP с сексуальным партнером. ESTP легко раздражаются и склонны избегать ситуаций с напряженными межличностными отношениями.
	</div>
	<div id="ESFJ" class="LettersCombinationText">
	ESFJ - ТОРГОВЕЦ<br>
ESFJ - наиболее общительные из всех типов, они черпают энергию во взаимоотношениях с людьми и склонны идеализировать всех и все, с чем имеют дело. Гармония - вот ключ к пониманию этого типа.
ESFJ замечательные воспитатели в широком смысле этого слова: в семье, в школе, в прочих социальных группах. Их, гостеприимство не знает границ, они готовы перейти на "ты" уже после первой встречи. В общественных собраниях они постоянно заботятся о том, чтобы все чувствовали себя комфортно и не оставались в стороне от обсуждаемых проблем. Социальные связи имеют важное значение для ESFJ, темой их разговора часто являются воспоминания с оттенком ностальгии.
Личностные качества ESFJ приводят их к выбору специальностей, связанных с торговлей, - в торговых операциях выигрыш всегда на стороне ESFJ. Главные роли в коммерческих организациях обычно играют представители этого типа. Интересен механизм действий ESFJ в данном случае: покупатель покупает не товар в магазине, он покупает что-то лично у ESFJ. Эти же качества обеспечивают успех ESFJ - учителей, администраторов, тренеров, вообще мастеров общения "один на один". ESFJ редко раздражают своих начальников, они уважают порядки и правила и следуют им неукоснительно.
ESFJ хорошо знают об ответственности, возлагаемой семьей на их плечи, обязательны в решении вопросов, касающихся семейного очага, и предпочитают, чтобы подобными качествами обладали остальные члены семьи. Общение с людьми, прием гостей приносят радость ESFJ. Они любят быстрое и безотлагательное воплощение принятых в семье решений, склонны к жизни по распорядку, знают цену времени. Выполнение повседневных операций не смущает ESFJ они разделяют традиционные взгляды на проблемы сохранения спокойной атмосферы в семье, уважают обеты, данные супругу, и вообще являются людьми, более других типов пекущимися о проблемах семьи.
	</div>
	<div id="ESFP" class="LettersCombinationText">
	ESFP - ТАМАДА<br>
	ESFP излучают оптимизм и теплоту. Вежливые, остроумные, говорливые, очаровательные собеседники, открытые для восприятия окружающего мира, - это ESFP. Они наиболее щедрые и веселые люди из всех типов. Актер - вот слово, наилучшим образом описывающее характер ESFP.
	ESFP постоянно ищут общения с людьми, избегая одиночества. ESFP легко найти себе компанию, так как их присутствие доставляет истинную радость окружающим. Волнение, приподнятое настроение - вот то, чего ждут ESFP от жизни. Их способ "игры в жизнь" очень заразителен, и вообще ESFP идут по жизни смеясь. Добродушное подтрунивание, полное очаровательного остроумия, делает ESFP приятными собеседниками. ESFP редко ошибаются в жизненных делах, они склонны одеваться по последней моде и брать от жизни все лучшее: одежду, пищу, физический и психологический комфорт.
	ESFP могут быть щедрыми до безрассудства и тогда - что принадлежит ESFP, принадлежит в равной мере его друзьям. ESFP помогают окружающим безвозмездно, даже без тени ожидания благодарности за это, так же они поступают и в любви. ESFP рассматривают жизнь, как рог изобилия, из которого непрерывным потоком льются приятные вещи, что, впрочем, не требует ни малейших усилий со стороны ESFP. Умение ESFP радоваться жизни иногда подводит их, делает их более подверженными различного рода искушениям по сравнению с представителями других типов. Они склонны к импульсивным поступкам, и таким образом ESFP, как мужчины, так и женщины, очень чувствительны к действию психологических или физических соблазнов. Родитель ESFP - это друг для ребенка, веселый и общительный. 
	ESFP наиболее раздражительные люди из всех типов, они стремятся не расстраиваться, закрывая глаза на темные стороны происходящих событий. ESFP склонны прощать себе мелкие грешки, однако афишированию своей своенравности они скорее предпочтут тихую покладистость, поступая в то же время по-своему.

	</div>
	<div id="ENTJ" class="LettersCombinationText">
	ENTJ - ФЕЛЬДМАРШАЛ<br>
Если нас попросят охарактеризовать ENTJ одним словом, мы выберем слово "командир". Основное желание и движущая сила ENTJ - это стремление руководить, и уже с детства они находятся во главе различных групп. Где бы они ни были, постоянно ощущают необходимость наводить порядок, используя энергию других людей для достижения этой цели. Их эмпирическое, объективное мышление может быть высокоразвитым, в таком случае они любят классифицировать и обобщать, сопоставлять различного рода информацию. Они похожи на ESTJ в своей склонности к планированию предприятий или организаций, но ENTJ охотнее стремятся к достижению целесообразности и постановке новых задач, чем к выполнению какого-либо плана.
Хотя ENTJ легко приспосабливаются к установленным порядкам, они могут отказаться от любого традиционного мероприятия, если оно покажется им бесполезным для достижения цели. Особенно не выносят неэффективных, пустых мероприятий, которые могут заставить их охладеть к начатому делу. Для ENTJ всегда должно иметься объективное объяснение цели какого-либо действия, так как субъективные чувства других людей они не считают достаточным основанием. В роли руководителя больше других типов любит (и умеет) составлять четкую картину цели деятельности предприятия и объяснять эту цель подчиненным. Такие люди находят себя в командной роли, иногда даже не вполне осознавая, как это произошло. ENTJ организуют свои предприятия как хорошо отлаженный механизм, с запланированным развитием, учитывая как ближайшие, так и перспективные цели. 
Они добиваются эффективности в работе персонала, предпочитают решения, принятые на основе объективной информации, любят хорошо продуманные планы и разработанные операции. Им доставляет удовольствие видеть, что люди следуют их примеру. Поддерживают благонадежность организации и надеются, что так же делают их сотрудники.
ENTJ обычно занимают высокие посты и довольны работой администратора. Они неутомимы в своей преданности работе и могут жертвовать ради любимого дела другими радостями жизни. Они способны бороться с неэффективностью производства, устраняя работников, создающих подобное положение.
	</div>
	<div id="ENTP" class="LettersCombinationText">
ENTP - ИЗОБPETATEЛЬ<br>
ENTP используют свои творческие способности в мире людей и вещей. Они полагаются на свои предчувствия и доверяют своему воображению во всех сферах жизни. ENTP хорошие аналитики, им нравится изучать сложные объекты. Обычно энтузиасты ENTP проявляют интерес буквально ко всему в мире, являясь источником вдохновения для окружающих. ENTP способны получать наслаждение от множества вещей и явлений, их легко обрадовать. ENTP нетерпимы к выполнению работы обычными методами, они постоянно изыскивают новые методы, новые проекты, новые занятия, нестандартные процедуры.
Конформизм - качество, свойственное ENTP. Они с готовностью принимают и используют любые правила, существующие в системе, для достижения любой цели. Они отлично, разбираются во внутренней политике в коллективе и на предприятии и умеют пользоваться этим пониманием. Их проницательность направлена скорее на то, чтобы понимать людей, чем их оценивать. ENTP не против внедрить что-либо новое в систему, если только она не подчинена тупому режиму. ENTP обычно проявляют незаурядные преподавательские способности, используя нестандартные методы обучения, облегчающие жизнь студентам, делающие обучение привлекательным. В любой работе ENTP не терпит устоявшейся традиционной системыvему нравится бросать вызов традициям. Быть в подчиненииvтяжкая участь для ENTP, такое положение сковывает их способности к импровизации и новаторству. 
ENTP истинные инженеры человеческих взаимоотношений и человеческих систем. Их острый юмор, оптимистическое мировоззрение заразительны, и многие люди ищут общества ENTP. 
	</div>
	<div id="ENFJ" class="LettersCombinationText">
	ENFJ - ПЕДАГОГ<br>
В различных общественных группах ENFJ обычно занимают место лидера. Они обладают уникальной способностью, утверждающей их в этой ответственной роли: ENFJ считают само собой разумеющимся тот факт, что люди пойдут за ними непременно и будут делать все, что бы ни предложил ENFJ-лидер. И чаще всего так и случается, потому что люди этого типа обладают необычайным обаянием. Придают большое значение взаимоотношениям с людьми и высоко ценят общество людей, себе подобных.
Иногда ENFJ считают себя в ответе даже за чувства других людей, что может осложнить взаимоотношения. В общении проявляют заботливость и способность сочувствовать. Поэтому люди обращаются к ENFJ в поисках поддержки, ценного совета и не обманываются в своих ожиданиях. Временами, однако, такой род взаимоотношений переутомляет ENFJ; они могут чувствовать комплекс неспособности уединиться. И все же едва ли ENFJ сможет отказаться от своей "благотворительности", даже если она становится обременительной.
Особенно склонны идеализировать взаимоотношения между людьми. Из-за этой тенденции могут невольно переоценивать своих друзей. Дополнительные сложности возникают из-за того, что друзья ENFJ чувствуют себя не в состоянии воплотить представления ENFJ о них. Однако бесспорно, что ENFJ крайне редко критикуют людей, очень терпеливы в дружбе и всегда действительно достойны доверия.
ENFJ думают, что люди отнесутся к ним так, как сами относятся к людям. Когда же обнаруживается, что позиция или мнение не встречает одобрения и не принимается, ENFJ удивлены, даже расстроены. К счастью, это не случается часто, так как ENFJ обладают способностью правильно и убедительно говорить, особенно ярко выступать в обществе; они истинные знатоки методов общения один на один, чего не скажешь, однако, об их письменной речи. Они могут оказывать воздействие на группы людей вне зависимости от размеров группы.
	</div>
	<div id="ENFP" class="LettersCombinationText">
ENFP - ЖУРНАЛИСТ<br>
Для ENFP ничто не происходит без определенного значения, они обладают почти сверхъестественным чутьем, позволяющим определить мотивы чужих поступков. Эта способность превращает жизнь ENFP в волнующую драму, полную возможностей и шансов. Благодаря своей способности влиять на окружающих ENFP играют заметные роли в обществе.
ENFP рассматривают постоянные эмоциональные переживания как жизненную необходимость, однако даже когда ENFP достигают подобного состояния, они все равно ощущают некоторый дискомфорт, неопределенное чувство отсутствия цельности своего душевного склада. ENFP стремятся к гармоничности, но постоянно ощущают опасность отрыва от реальности, от тех эмоций, которые так им нужны.
ENFP постоянно упражняются в изучении окружающей действительности, и ничто новое и необычное не ускользает от их бдительного внимания. Они искусные и глубокие исследователи, способные сконцентрироваться на изучении какого-либо явления или отдельного человека, не забывая в то же время и об окружающей действительности. Их внимание никогда не бывает рассеянным или пассивным, оно всегда имеет определенную направленность. Иногда ENFP характеризуют и объясняют чужие поступки, опираясь на некие "скрытые, внутренние мотивы", придавая особое значение на первый взгляд случайным словам и поступкам. Являясь высоко чувствительными людьми, ENFP способны допускать серьезные просчеты в принятии решений, что может создавать проблемы. Такие ошибки происходят в результате излишней сконцентрированности ENFP на фактах, подтверждающих их собственные представления. ENFP могут быть абсолютно корректны в сборе информации, но при этом ошибаться в логических выводах.
	</div>
	<div id="ISTJ" class="LettersCombinationText">
	ISTJ - ОПЕКУН<br>
	ISTJ характеризуются решительностью в критических ситуациях, являются хранителями вековых традиций, и если бы вы хотели описать их одним словом, то слово "надежный" подошло бы наилучшим образом к этим людям. Слово ISTJ - закон; их часто заботит сложное положение в стране, в городе, на производстве, в семье. Дома и на работе люди этого типа довольно спокойны и серьезны. ISTJ необычайно настойчивые и надежные люди одна лишь - мысль о нарушении какого-либо договора пугает их. Когда ISTJ дает слово v это слово чести. На ISTJ можно рассчитывать как на человека, пекущегося о процветании своего учреждения, вносящего в работу практический взгляд на вещи. Они выполняют свой долг без излишней броскости н рекламы, таким образом преданность ISTJ делу может оставаться незамеченной и недооцененной.
	ISTJ любят основательность и детальность, справедливость, практичность. Такие предпочтения приводят их к выбору профессий, где их преимущества проявляются в большей степени. Например, ISTJ бывают замечательными банковскими контролерами, ревизорами, сборщиками налогов. Занятость в службе безопасности, вероятно, заинтересует людей этого типа. ISTJ едва ли станут рисковать своими или чужими деньгами.
	ISTJ успешно разбираются в сложных и многогранных профессиональных задачах. Они способны работать в качестве ответственного секретаря, ученого-юриста, преподавателя в высшей школе бизнеса или на курсах ведения домашнего хозяйства. В то же время и высокопоставленные офицеры могут быть ISTJ. Часто кажется, что ISTJ абсолютно нечувствительны по отношению к критике.
	</div>
	<div id="ISTP" class="LettersCombinationText">
	ISTP - МАСТЕР <br>
ISTP импульсивны, как и все SP; их жизнь - это артистическое действо, и любой поступок имеет самостоятельную ценность. Более же всего ISTP ценят поступки, рождающиеся сами по себе, импульсивные, не связанные с какой-либо целью. Если же действия подчинены какой-либо цели, ISTP все же хотели бы, чтобы она не влияла на форму и содержание действий. Чувство равенства сильно развито у ISTP - они бывают бесконечно преданными в дружбе. В то же время, по мнению ISTP, субординация, равно как и авторитарность, вещи совершенно излишние в любой системе. Такая позиция приводит не к борьбе против существующего положения, а скорее к его игнорированию: "ISTP должен делать свое дело и быть свободным в выборе действий и поступков".
ISTP часто отличаются бесстрашием, рискуя во всевозможных ситуациях, невзирая на опасность. Вся деятельность ISTP представляет собой вызов судьбе, шансу, случайности. Они жаждут волнующих событий и острых переживаний, стремясь, к примеру, участвовать в автомобильных гонках, серфинге, пилотировании. Подобная жажда возбуждающих действий делает их наиболее подверженными влиянию скуки, это стремление заставляет их постоянно ускорять ритм жизни. Любое новое действие, даже не располагающее к спешке, подобно рыбалке, охоте, путешествию, спасает их от скуки.
ISTP действуют по наитию, если "чувствуют" способ, которым что-либо должно быть сделано, и в таких случаях лучше им не мешать. Альпинисты, гонщики, пилоты, охотники и вообще собирательный образ очень подвижного человека - вот портрет ISTP. Поводом к общению для них служит обращение с инструментом или орудием труда, темы отвлеченно-логические не занимательны для ISTP. Таким образом, недостаточная заинтересованность в общении с людьми может быть расценена невнимательным педагогом как "неспособность к обучению", что является примером ошибочного подхода к решению проблемы без изучения скрытых ее механизмов. Дайте ISTP возможность продемонстрировать свои способности в сфере общения с резцом или автомобилем, и вы убедитесь, как легко он обойдет в обучении представителей иных типов и как будет точен его лексикон в объяснении технологических тонкостей.
Несмотря на свое пристрастие к братским взаимоотношениям, на неумение подчиняться системе, ISTP могут быть лидерами, даже выдающимися. В таком случае они должны быть впереди с оружием в руках, ведя за собой войска. Кстати, ISTP могут быть замечательными полководцами вне зависимости от величины подчиненной группы. Их реалистичный подход, точная оценка времени и чувство целесообразности различных мероприятии позволяет им верно оценить любую критическую ситуацию и использовать все возможные ресурсы для достижения успеха, пользуясь в то же время малейшими недостатками и просчетами противника. Их таланты в деле управления людьми на грани катастрофы базируются на качестве, которое условно можно назвать "артистическая конкретность". 
Например, способность руководить войсками в боевых ситуациях - это своеобразное искусство, интеллектуальная игра (не относящаяся к области стратегии, где царствуют NT), скорее, это стремление с наименьшими потерями победить соперника, используя для этой цели все, что имеется под рукой.
	</div>
	<div id="ISFJ" class="LettersCombinationText">
	ISFJ - ХРАНИТЕЛЬ ТРАДИЦИЙ<br>
Движущая сила ISFJ - желание быть полезными людям. Хорошо чувствуют смысл истории, связь прошлых событий с ситуацией, сложившейся на данный момент. ISFJ склонен работать часами, не отрываясь; полученное задание должно быть выполнено в совершенстве, если только это в силах сделать человек. Традиционные и испытанные методы работы высоко ценятся ISFJ и пользуются их уважением. Процедуры, диктуемые руководствами и справочниками, - закон для ISFJ, и если кто-либо пренебрегает подобными условиями, это вызывает раздражение и недовольство JSFJ. Обычно подобное раздражение уходит внутрь и служит источником слабости или избыточного мышечного напряжения ISFJ.
ISFJ "сверхпослушны" и "сверхисполнительны" - едва ли им доставит радость работа в условиях постоянно изменяющихся правил. Их главная потребность - быть нужным людям - приводит к выбору специальностей медицинских сестер, учителей, библиотекарей, секретарей и административных посредников. Находят себя в общении с людьми, которые испытывают в них нужду: с больными, студентами, "боссами". Больше всего удовольствия получают, когда им предоставляется возможность заботиться о потребностях других людей, и они выполняют подобную работу внимательно и терпеливо. Обладают повышенным чувством ответственности и выдающимся талантом в выполнении стандартных операций, требующих повторных последовательных манипуляций. Рассуждения и теории не интересуют ISFJ, предоставляющих другим свободу операций в абстрактных сферах.
ISFJ совершают поступки, скорее основываясь на личных представлениях о людях, чем на каких-либо логических выкладках. От окружающих, включая и патрона, ISFJ ожидают выполнения заведенных стандартных процедур и бывают удивлены, даже расстроены, если подобные ожидания не подтверждаются. Часто чувствуют себя в ответе за выполнение коллегами рутинных операций на предприятии или в учреждении. Преимущества, связанные с титулом, положением или званием, хорошо известны ISFJ, и они умеют из этою знания извлекать пользу. ISFJ известна ценность материальных ресурсов, они не выносят расточительства. Спасти, уберечь кого-либо от возможных невзгод и неприятностей, быть всегда готовым к возможной опасности расцениваются ISFJ как дело первостепенной важности.
ISFJ испытывают некоторый дискомфорт, занимая руководящее положение, и склонны даже выполнить часть работы за других, вместо того, чтобы заставить кого-то делать свое дело. В результате часто переутомляются. ISFJ преданы своему супругу и семье и часто являются замечательными хозяевами в доме. Дом ISFJ отлично обустроен как внутри, так и снаружи. Интерьер и обстановка детально выдержаны в лучших традициях. Родитель ISFJ надеется воспитать в детях чувство доверия к заведенным в обществе правилам и старается на собственном примере доказать действенность существующих порядков. Вдохновенная импровизация кажется ISFJ явлением несколько дурного тона, и они предпочитают вспыльчивым и артистичным натурам более скромных и выдержанных друзей. 
	</div>
	<div id="ISFP" class="LettersCombinationText">
	ISFP - ХУДОЖНИК<br>
Хотя все SP - прирожденные мастера, но никто другой так не стремится к совершенствованию своих качеств, как это делают ISFP. В любом случае ISFP наиболее из всех SP склонны к художественному творчеству: самые одаренные композиторы, художники или танцоры, как правило, относятся к ISFP типу темперамента. Бетховен, Рембрандт, согласно биографическому анализу, были ярко выраженными ISFP. Однако темперамент ISFP трудно определить с большой точностью даже у выдающихся артистов, и посему ISFP, возможно, наименее понятные люди из всех типов.
Источником непонимания является свойство ISFP проявлять свои особенности не открыто, а косвенно, посредством выразительных действий. Если им удается достичь творческого самовыражения в том или ином роде искусств, их характер выражается особенно ярко. Но если даже ISFP удается найти себя на художественном поприще, их натура не становится от этого более понятной для окружающих.
При ближайшем рассмотрении эти люди почти так же порывисты и импульсивны, как и остальные SP. ISFP предпочитают эпикурейский образ жизни в данном месте и в данный момент времени, делая это с максимальной грациозностью и гармоничностью. Они не планируют и не готовятся заблаговременно, их уход в искусство - это не подготовка к чему-то в будущем; скорее, они любят остроту ощущения текущей минуты. ISFP не ждут, так как ждать - это значит наблюдать постепенное угасание и гибель собственных импульсов, а для ISFP внутренний импульс - основа жизни. Также нечувствительны ISFP к артистической технике, скорее, они отдаются всепобеждающей мощи урагана искусств. 
Действие - вот хозяин ISFP, и следует сразу же отказаться от представления о них, как об увлеченных планированием и обязательных людях, склонных к подготовке и репетициям. Перспективные цели не имеют для них значения.
ISFP обладают особым родом интеллекта. Заметьте, что наше представление об интеллекте состоит в том, что интеллект - это способность делать что-либо хорошо в изменяющихся условиях. Эта особая форма интеллекта может быть названа "исполнительской точностью". Исполнительская точность непосредственно сближает ISFP с миром реальных вещей. Зов к орудию или инструменту проявляется у ISFP в форме непреодолимой тяги к краскам, линиям, формам строения, теням посредством ощущения и восприятия окружающей гармонии. Чувства ISFP обычно обострены до крайней степени по сравнению с представителями других типов. Рембрандт мог почти на вкус определять различные оттенки, слова Хемингуэя несут в себе солоноватый привкус и терпкий запах зеленой морской волны. 
Подобная чувствительность и конкретность восприятия органично вплетается в структуру личности ISFP, пронизывая все ее стороны и проявления.
	</div>
	<div id="INTJ" class="LettersCombinationText">
	INTJ - ИССЛЕДОВАТЕЛЬ<br>
INTJ - наиболее самоуверенные люди, безгранично верящие в себя и свои силы. Они живут своим внутренним миром, концентрируясь на возможностях и вероятностях предстоящих событий, опираясь на свои логические умозаключения и предпочитая, чтобы вещи и люди приносили какую-нибудь пользу. Решение приходит к INTJ подспудно, и как только оно принято, INTJ чувствует облегчение. INTJ интересуется будущим больше, чем прошлым, и если пытаться кратко определить характер, его можно назвать "строитель системы", то есть человек, умеющий применить на практике теоретические модели и схемы.
INTJ абсолютно не признают авторитетов, базирующихся на общественном положении, званиях или прошлых заслугах. Не подвержены влиянию лозунгов, призывов и различного рода пропагандистских высказываний. В оценке достоинств какой-либо теории полагаются только на свое собственное мнение, невзирая даже на тех, кто отстаивает сходные позиции. Авторитет вообще не впечатляет INTJ.
Однако INTJ склонны следовать определенным правилам, если они полезные - не потому, что верят в их справедливость, а потому, что они по-своему относятся к реальности. INTJ рассматривают реальность как нечто довольно капризное и надуманное. Поэтому реальность можно либо использовать в качестве инструмента для достижения цели, либо игнорировать. Реальность - субстанция ковкая и изменчивая; ее можно и следует подчинять собственным интересам, она - тот фактор, который усложняет процесс оттачивания идей, и в этом смысле INTJ наиболее теоретичный тип людей. Для INTJ действительность - некий груз в царстве идей. Ни одна идея не является настолько труднодоступной, чтобы над ней не следовало подумать. 
От природы наделены способностью к "мозговому штурму", всегда открыты для восприятия новых концепций и постоянно активно ищут их.
Стремятся к завершенности, всегда помня о последствиях своих действий, всегда глядя в будущее. Идеи имеют собственную, независимую ценность, хотя каждая из идей и проходит испытания на применимость и полезность. Трудности лишь подхлестывают INTJ, любящих поднимать перчатку вызова. Такие характеристики приводят их к профессиональной деятельности, где теоретические модели можно претворять в жизнь. Являясь представителями любых профессий, склонны к систематизированию. Они могут добиваться одинаково хороших результатов как в роли научного исследователя, так и в роли администратора, способного к воплощению и применению на практике любых идей. 
Если INTP являются архитекторами систем, то дело INTJ - организовать процесс так, чтобы на практике применить системы, построенные INTP.
	</div>
	<div id="INTP" class="LettersCombinationText">	
	INTP - АРХИТЕКТОР<br>
	Из всех типов людей INTP наиболее тонко понимают и ценят мысль и речь: они мгновенно подмечают детали и дефекты речи, их интересует сам процесс мышления. К INTP наилучшим образом подходит определение "архитектораv-архитектор идей и систем, так же как архитектор, в буквальном смысле слова.
	INTP с легкостью обнаруживают противоречия в тех случаях, когда их не видят представители других типов. Мгновенная оценка ситуацииv-замечательное интеллектуальное свойство INTP. Люди этого типа четко сознают соответствие между целями и средствами, и это делает их способными к концентрации внимания и усилий на одной выбранной ими деятельности.
	INTP - логики, математики, философы, ученые; любое дело, в котором требуется архитектор идей - дело для INTP. Однако не следует требовать от INTP разработки методов применения теорий на практике. INTP - архитектор систем, он предоставляет другим возможность строить, воплощать и применять. Очень часто поэтому работа не создает громкого имени INTP. Строитель и организатор, воплотивший идею, пожинает плоды с пышного дерева славы, а INTP - истинный творец идеи - остается в тени. 
	</div>
	<div id="INFJ" class="LettersCombinationText">
	INFJ - ПРЕДСКАЗАТЕЛЬ<br>
Хорошо ориентируются в различных жизненных ситуациях, включая и самые сложные из них. Именно INFJ особенно прозорливы в оценке событий настоящего и прошлого. Им также свойственна незаурядная способность прогнозировать будущее.
Характерно, что INFJ способны настолько глубоко прочувствовать глубинные течения человеческой души, что часто замечают эмоции и настроения людей до того, как это замечает сам наблюдаемый человек. Такая проницательность часто смущает и даже отпугивает людей других типов. INFJ интуитивно распознают добро и зло в людях, хотя редко способны объяснить, каким образом они достигли такого понимания. Последующие события часто подтверждают их выводы. Обычно хорошо учатся и работают - скромно, без излишнего шума. Они серьезно относятся к своей работе и любят самообразование. 
При решении каких-либо проблем они часто прилагают даже больше усилий, чем этого требует задача. Редко являются яркими лидерами, но их скрытое влияние ощущается во всех областях их деятельности.
Очень трудно проникнуть в чрезвычайно богатый духовный мир INFJ. Они не делятся секретами с теми, кому не полностью доверяют. Легко ранимы из-за своей развитой способности углубляться в себя и изучать людей безмолвно, поэтому они и обладают таким свойством, как скрытность. Даже люди, живущие с ними долгие годы, могут вдруг обнаружить совершенно незнакомое им свойство характера.
Любят радовать окружающих. Они предпочитают соглашаться с людьми и считают любой конфликт неприемлемым и разрушительным. Раскрепощенное воображение часто приводит INFJ в область искусства: музыка, математические системы, поэзия, драматургия, беллетристика становятся делом жизни. К слову сказать, INFJ - самые поэтичные люди. Так же, как ENTJ не может не быть лидером, нельзя представить INFJ, не обладающего интуицией. Это свойство распространяется на людей, события, вещи принимая формы предвидений, предсказаний, вплоть до слуховых и зрительных галлюцинаций.
Часто выбирают свободные творческие профессии и предпочитают деятельность, связанную с взаимоотношениями один на один. Например, преуспевающий практик в медицине, психолог, психиатр может быть INFJ. INFJ может избрать перо орудием труда, и тогда его воображение сделает язык ярким и увлекательным, поэтичным и полным мистических картин, Мастера метафор, их устная и письменная речь отличается утонченностью, элегантностью и сложностью. Их яркие лингвистические способности используются как для описания людей, так и для общения с людьми. INFJ пишет всегда для какого-то конкретного лица, творчество для безликой, абстрактной аудитории лишает его вдохновения.

	</div>
	<div id="INFP" class="LettersCombinationText">
	INFP - РОМАНТИК<br>
INFP - спокойные, сдержанные и даже застенчивые люди. Хоть на первый взгляд они неприступны, это вовсе не так. Обладают способностью заботиться о близких им людях, и в своей заботливости они преданы до конца. То же можно сказать и о мире идей INFP. "Идеалист", "романтик" - вот слова, описывающие INFP. Временами эта характеристика удаляет INFP от людей.
Обладают сильнейшим чувством чести и собственного достоинства. Они ищут цельности в своей жизни, единства тела и души, эмоций и интеллекта. Что-то трагичное присутствует в судьбе INFP, но окружающие редко замечают это. Преданность делу добра и справедливости приводит к полнейшему неприятию всего дурного, что, в свою очередь, может привести к борьбе со всякого рода злом. Таким образом, существует некая двойственность натуры, стремящихся к добру и оглядывающихся на все темное и злое.
Метафоры и сравнения легко приходят к INFP, но зачастую бывают натянутыми. Обладают даром яркого символизма и часто выражаются лирически. Часто позволяют себе вольности по отношению к логике. Иногда они могут проявлять неоправданную беззаботность в деловой сфере, так как из-за своего импрессионистского подхода к реальности пренебрегают учетом деталей, необходимых для успешной деятельности. Гипотезы не интересуют INFP.
В работе способны воспринимать новые идеи и информацию, хорошо понимают людей, их желания, хорошо относятся к большинству коллег, соблюдая при этом некоторую психологическую дистанцию. Успешно работают как в одиночестве, так и в коллективе; они внимательно относятся к разрешению сложных ситуаций, но рутинные операции утомляют. Они могут ошибаться в фактах, но едва ли ошибутся в итоговой оценке чего-либо. Обучение - всегда привлекательный процесс, в частности, они обладают способностями в изучении языков. Часто, слыша призыв о помощи, бросаются вперед, не останавливаясь перед жертвами. 
Бывают выдающимися писателями, актерами, исполняющими характерные роли, потому что они могут растворить личность в портрете или ином характере так, как другим типам редко удается.
Супруги INFP преданы своим обетам. Они стремятся создать гармоничные отношения в семье и способны на значительные жертвы во имя этой цели. Они очень чувствительны и отзывчивы, им нравится делать близким людям приятное. Однако для INFP очень сложно примирить романтические идеализированные представления о браке с реальной повседневной жизнью с другим человеком. Опасаются расслабляться в счастливой супружеской жизни. Им бывает трудно выразить желание прямо, и предпочитают переносный смысл. Характерно, что INFP боятся слишком громких успехов, ожидая возможной расплаты.
	</div>

	
	
	
	
	
	
	<script type="text/javascript">

		var LettersCombination = function () {
			
			var LastCombination = new Array(),
				Combination = new Array(),
				CombinationLength = 4,
				DescriptionDiv,
				HeaderDiv;
			

			Combination[1] = "E";
			Combination[2] = "S";
			Combination[3] = "T";
			Combination[4] = "J";
			
			DescriptionDiv = document.getElementById("DescriptionDiv");
			DescriptionDiv.appendChild(document.getElementById("ENTP"));
			HeaderDiv = document.getElementById("HeaderDiv");
			
			LastCombination[1] = "E";
			LastCombination[2] = "N";
			LastCombination[3] = "T";
			LastCombination[4] = "P";
			

			this.setLettersCombination = function (letter, position) {
			
				if (position > 0 && position <= CombinationLength) {
					LastCombination = Combination.slice();
					Combination[position] = letter;
					this.updateVisual();
				}
			
			}
			
			this.updateVisual = function () {
				last_combination = "";
				combination = "";
				for (var i = 1; i <= CombinationLength; i++) {
					last_combination += LastCombination[i];
					combination += Combination[i];
				}
				last_element = document.getElementById(last_combination);
				element = document.getElementById(combination);
				
				//window.alert("L C: " + last_combination + " Comb:" + combination);
				
				last_element.style.visibility = "hidden";
				element.style.visibility = "visible";
				document.body.appendChild(last_element);
				DescriptionDiv.appendChild(element);
				
				HeaderDiv.innerHTML = combination;	
				
				//window.alert("L C: " + last_combination + " Comb:" + combination);
				
			}
			this.updateVisual();
			
		};
		var E = document.getElementById("E");
		var I = document.getElementById("I");
		var S = document.getElementById("S");
		var N = document.getElementById("N");
		var F = document.getElementById("F");
		var T = document.getElementById("T");
		var J = document.getElementById("J");
		var P = document.getElementById("P");
			
		var LC = new LettersCombination();
		
		E.onclick = function () {
			LC.setLettersCombination("E", 1);
		}
		I.onclick = function () {
			LC.setLettersCombination("I", 1);
		}
		S.onclick = function () {
			LC.setLettersCombination("S", 2);
		}
		N.onclick = function () {
			LC.setLettersCombination("N", 2);
		}
		F.onclick = function () {
			LC.setLettersCombination("F", 3);
		}
		T.onclick = function () {
			LC.setLettersCombination("T", 3);
		}
		J.onclick = function () {
			LC.setLettersCombination("J", 4);
		}
		P.onclick = function () {
			LC.setLettersCombination("P", 4);
		}						
	</script>




</body>

</html>
